@extends('dr.panel.layouts.master')

@section('styles')
  <link type="text/css" href="{{ asset('dr-assets/panel/css/panel.css') }}" rel="stylesheet" />
  <link type="text/css" href="{{ asset('dr-assets/panel/css/turn/schedule/counseling/consult-term/consult-term.css') }}"
    rel="stylesheet" />
@endsection

@section('site-header')
  {{ 'به نوبه | پنل دکتر' }}
@endsection

@section('content')
@section('bread-crumb-title', 'قوانین و مقررات')

<div class="consult-term-content mt-2 w-100 d-flex justify-content-center">
  <div class="consult-term-content-wrapper">
    <div class="top-logo w-100 d-flex justify-content-center">
      <img src="{{ asset('app-assets/logos/benobe.svg') }}" alt="benobe-logo">
    </div>
    <section class="terms-section">
      <p class="intro-text font-weight-bold">
        ایجاد تجربه‌ی درمانی بی‌نقص و رضایت‌بخش برای بیماران، یکی از مهم‌ترین اهداف به نوبه است. در این راستا، قوانین و
        مقرراتی تدوین شده است که رعایت آن‌ها برای همکاری پزشکان و بیماران با به نوبه الزامی است.
      </p>

      <!-- قوانین مربوط به پزشکان -->
      <h2 class="section-title">قوانین مربوط به پزشکان</h2>
      <div class="rule-item">
        <strong>۱. آغاز ویزیت در زمان مقرر:</strong>
        <p>ویزیت آنلاین باید در زمان تعیین‌شده آغاز شود. پاسخ‌دهی به‌موقع به بیماران برای برآورده کردن انتظارات آنان از
          اهمیت بالایی برخوردار است.</p>
      </div>
      <div class="rule-item">
        <strong>۲. مدت‌زمان و پیوستگی ویزیت:</strong>
        <p>ویزیت آنلاین باید در مدت‌زمان اعلام‌شده توسط پزشک و به‌صورت جامع و پیوسته انجام شود. همچنین، پزشکان می‌بایست
          تا ۳ روز پس از ویزیت، برای پاسخگویی به سوالات احتمالی بیمار در دسترس باشند.</p>
      </div>
      <div class="rule-item">
        <strong>۳. ارتباط بیمار پس از ویزیت:</strong>
        <p>بیماران می‌توانند تا ۳ روز پس از ویزیت برای ارسال مستندات، آزمایشات و سوالات دارویی با پزشک ارتباط برقرار
          کنند.</p>
      </div>
      <div class="rule-item">
        <strong>۴. پاسخگویی به بیماران:</strong>
        <p>در صورتی که پزشک به مدت ۳ روز متوالی پاسخگوی هیچ‌یک از بیماران ویزیت آنلاین و پشتیبانی نباشد، به دلیل عدم
          اطلاع از وضعیت پزشک، نوبت‌دهی به بیماران متوقف خواهد شد.</p>
      </div>
      <div class="rule-item">
        <strong>۵. لغو نوبت بیمار به درخواست او:</strong>
        <p>اگر بیماری درخواست لغو نوبت داشته باشد و با پشتیبانی ارتباط بگیرد و دلیل منطقی برای این درخواست ارائه دهد،
          پشتیبانی دو مرتبه با پزشک در ساعات کاریِ پزشک جهت بررسی درخواست بیمار تماس خواهد گرفت. در صورتی که پزشک پاسخگو
          نباشد، نوبت بیمار لغو خواهد شد.</p>
      </div>
      <div class="rule-item">
        <strong>۶. دریافت هزینه ویزیت:</strong>
        <p>پزشکان باید از دریافت هرگونه حق ویزیت اضافه یا خارج از پروسه‌ی دریافت نوبت به نوبه و همچنین ارائه شماره کارت
          به بیمار، جداً خودداری نمایند و در صورت رخداد تذکر لازم به پزشک ارائه خواهد شد و در صورت تکرار امتیاز منفی
          برای پزشک درج خواهد شد که در رتبه‌بندی پزشک در نتایج جستجوی پزشکان تأثیر خواهد داشت.</p>
      </div>
      <div class="rule-item">
        <strong>۷. شروع ویزیت در پنل:</strong>
        <p>هنگام شروع ویزیت، پزشکان باید دکمه “پذیرش” را در پنل خود فعال کنند. در غیر این صورت، بیمار حق لغو و استرداد
          هزینه را خواهد داشت.</p>
      </div>
      <div class="rule-item">
        <strong>۸. ارسال توضیحات درمان و نسخه الکترونیک:</strong>
        <p>توضیحات درمانی و نسخه الکترونیک باید حداکثر ۳۰ دقیقه پس از زمان نوبت برای بیمار ارسال شود. هزینه ویزیت پس از
          اعلام مراجعه و ارسال توضیحات درمانی و نسخه، محاسبه می‌شود.</p>
      </div>
      <div class="rule-item">
        <strong>۹. حفظ حریم خصوصی بیمار:</strong>
        <p>پزشکان باید حریم خصوصی بیماران و اطلاعات شخصی آن‌ها را محترم شمارند. هیچ پزشکی نباید از اطلاعات شخصی بیمار،
          که در جریان ویزیت آنلاین به دست آورده است، برای تهدید یا فشار به بیمار استفاده کند و در صورت رخداد، برای پزشک
          امتیاز منفی درج خواهد شد که در رتبه‌بندی پزشک در نتایج جستجوی پزشکان تأثیر خواهد داشت و در صورت تکرار نوبت‌دهی
          پزشک معلق خواهد شد.</p>
      </div>
      <div class="rule-item">
        <strong>۱۰. رعایت احترام و عدم قضاوت در حوزه‌ای غیر از درمان:</strong>
        <p>پزشکان باید با تمامی بیماران بدون توجه به عقاید، سبک زندگی یا شرایط شخصی آنان، با احترام و بی‌طرفی برخورد
          کنند. هرگونه توهین، تهمت یا قضاوت اخلاقی نسبت به بیمار به هیچ وجه پذیرفته نیست و در صورت رخداد برای پزشک
          امتیاز منفی درج خواهد شد که در رتبه‌بندی پزشک در نتایج جستجوی پزشکان تأثیر خواهد داشت و در صورت تکرار نوبت‌دهی
          پزشک معلق خواهد شد.</p>
      </div>
      <div class="rule-item">
        <strong>۱۱. عدم افشای اطلاعات شخصی بیمار:</strong>
        <p>پزشکان باید تمامی اطلاعات شخصی و پزشکی بیماران را به‌طور کامل محرمانه نگه دارند و هیچ‌گونه افشای این اطلاعات
          مجاز نیست. اطلاعات شخصی شامل نام، شماره تماس، کد ملی، نوع بیماری و سایر اطلاعات حساس بیمار است. هرگونه افشای
          این اطلاعات در بستر به نوبه، جرم محسوب می‌شود و می‌تواند تبعات قانونی به همراه داشته باشد.</p>
      </div>
      <div class="rule-item">
        <strong>۱۲. عدم ثبت تخصص غیرواقعی:</strong>
        <p>هر فردی که اقدام به ثبت تخصصی نماید که مدارک تحصیلی مرتبط با آن تخصص را ندارد، به عنوان ثبت تخصص غیرواقعی
          شناخته می‌شود. این عمل به عنوان تخلف محسوب شده و مستلزم افت رتبه در نتایج جستجوی پزشکان به نوبه خواهد شد.</p>
      </div>
      <div class="rule-item">
        <strong>۱۳. ویزیت توسط پزشک یا درمانگر:</strong>
        <p>ویزیت بیماران تنها باید توسط پزشک صاحب پروفایل انجام شود. انجام ویزیت توسط فردی غیر از پزشک صاحب پروفایل، از
          جمله منشی، دستیار، کارآموز و سایر افراد، تخلف محسوب می‌شود و این عمل به دلیل سوءاستفاده از اعتماد بیمار و آسیب
          به اعتبار پلتفرم غیرقابل قبول است و می‌تواند منجر به بسته شدن نوبت‌دهی آن پزشک گردد.</p>
      </div>

      <!-- قوانین مربوط به بیماران -->
      <h2 class="section-title">قوانین مربوط به بیماران</h2>
      <div class="rule-item">
        <strong>۱. حضور به‌موقع در زمان نوبت:</strong>
        <p>بیماران موظف هستند در رأس زمان نوبت تعیین‌شده جهت ویزیت آنلاین حضور یابند و آماده ارتباط با پزشک باشند.</p>
      </div>
      <div class="rule-item">
        <strong>۲. رعایت مدت‌زمان ویزیت:</strong>
        <p>بیماران باید ویزیت خود را در مدت‌زمان اعلام‌شده توسط پزشک و به‌صورت جامع و پیوسته انجام دهند. درخواست برای
          چندین ویزیت در یک جلسه تنها با صلاحدید پزشک ممکن است، و پزشک می‌تواند در صورت صلاحدید درخواست‌های اضافی را رد
          کند و از بیمار بخواهد که نوبت جدیدی بگیرد.</p>
      </div>
      <div class="rule-item">
        <strong>۳. حفظ احترام به پزشک:</strong>
        <p>بیماران باید در تمامی مراحل ویزیت، احترام به پزشک را حفظ کنند و از هرگونه توهین، تهمت یا افترا خودداری
          نمایند.</p>
      </div>
      <div class="rule-item">
        <strong>۴. محدودیت ارتباط پس از ویزیت:</strong>
        <p>بیماران باید توجه داشته باشند که پس از ویزیت، حداکثر تا ۳ روز می‌توانند برای ارسال مستندات یا سوالات با پزشک
          ارتباط برقرار کنند. در صورتی که پس از این مدت پیام ارسال شود، پزشک حق دارد که به این پیام‌ها پاسخ ندهد یا
          بیمار را به رزرو نوبت جدید ارجاع دهد.</p>
      </div>
      <div class="rule-item">
        <strong>۵. عدم ایجاد مزاحمت برای پزشک:</strong>
        <p>بیماران باید از هرگونه تماس یا ارتباط خارج از موضوع درمان با پزشک خودداری کنند. ایجاد هرگونه مزاحمت برای
          پزشک، نظیر تماس‌های مکرر یا مکالمه‌هایی خارج از عرف و حیطه پزشکی، غیرمجاز است.</p>
      </div>

      <p class="intro-text mt-4">
        از همراهی شما در ارائه و استفاده از خدمات ویزیت آنلاین به نوبه بسیار سپاسگزاریم. رعایت این قوانین به شما کمک
        می‌کند تا تجربه‌ای مثبت و حرفه‌ای را در این بستر ایجاد کنید.
      </p>
    </section>
  </div>
</div>
@endsection

@section('scripts')
<script src="{{ asset('dr-assets/panel/jalali-datepicker/run-jalali.js') }}"></script>
<script src="{{ asset('dr-assets/panel/js/dr-panel.js') }}"></script>
<script>
  var appointmentsSearchUrl = "{{ route('search.appointments') }}";
  var updateStatusAppointmentUrl = "{{ route('updateStatusAppointment', ':id') }}";
</script>
@endsection
